meeting/agenda/2023/05-23.org
:PROPERTIES:
:ID:       849D420A-3E9F-4F27-BDA6-9F05379F3ED4
:END:
#+title: QT4 CG Meeting 035 Agenda 2023-05-23
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00BST (17:00CEST, 11:00EDT, 08:00PDT).

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2023/05-16.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for
23 May,
the following meeting is scheduled for
30 May.

Any regrets for the following meeting?

** Review of open action items [1/12]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group
+ [ ] QT4CG-016-08: RD to clarify how namespace comparisons are performed.
+ [ ] QT4CG-026-01: MK to write a summary paper that outlines the decisions we need to make on “value sequences”
  + This is related to PR #368: Issue 129 - Context item generalized to context value and
    subsequent discussion.
+ [ ] QT4CG-029-01: RD+DN to draft spec prose for the “divide and conquer” approach outlined in issue #399
+ [ ] QT4CG-029-07: NW to open the next discussion of #397 with a demo from DN
  See PR [[https://qt4cg.org/dashboard/#pr-449][#449]]
+ [ ] QT4CG-034-01: CG to add exception for date-time types to ~deep-equal~
+ [ ] QT4CG-034-02: NW to check ExprSingle on PR #447 before merging this PR.
+ [ ] QT4CG-034-03: NW to check why the diff for PR #447 is off the wrong base

** Review of open pull requests
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-454][#491]]: Fix more examples in the FO 4.0 spec

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-512][#512]]: 256: Context for default function parameter expressions
+ PR [[https://qt4cg.org/dashboard/#pr-470][#470]]: 369 add fixed-prefixes attribute in XSLT
+ PR [[https://qt4cg.org/dashboard/#pr-412][#412]]: 409, QT4CG-027-01: xsl:next-match
+ PR [[https://qt4cg.org/dashboard/#pr-396][#396]]: 333: Deep-equal, no failure when comparing functions
+ PR [[https://qt4cg.org/dashboard/#pr-368][#368]]: 129: Context item generalized to context value

* Technical Agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** Issue #504: Merge map:keys and map:keys-where
:PROPERTIES:
:CUSTOM_ID: iss-504
:END:

+ See [[https://github.com/qt4cg/qtspecs/issues/504][#504]]

Assuming we agree to merge them, then:

*** PR #515: 504: Merge map:keys and map:keys-where
:PROPERTIES:
:CUSTOM_ID: pr-515
:END:

+ See [[https://qt4cg.org/dashboard/#pr-515][#515]]

** PR #470: 369 add fixed-prefixes attribute in XSLT
:PROPERTIES:
:CUSTOM_ID: pr-470
:END:

+ See [[https://qt4cg.org/dashboard/#pr-470][#470]]

** PR #396: 333: Deep-equal, no failure when comparing functions
:PROPERTIES:
:CUSTOM_ID: pr-396
:END:

+ See PR [[https://qt4cg.org/dashboard/#pr-396][#396]]

** Issue #480: Allow type promotion of xs:string to xs:anyURI
:PROPERTIES:
:CUSTOM_ID: iss-480
:END:

+ See Issue [[https://github.com/qt4cg/qtspecs/issues/480][#480]].

** Issue #414: Lift character set restriction of xs:string
:PROPERTIES:
:CUSTOM_ID: iss-414
:END:

+ See Issue [[https://github.com/qt4cg/qtspecs/issues/414][#414]].

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:
