meeting/agenda/2023/05-23.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 035 Agenda 2023-05-23</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 035 Agenda 2023-05-23</h1>

<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00BST (17:00CEST, 11:00EDT, 08:00PDT).
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for details.
</p>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>

<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2023/05-16.html">the previous meeting</a>.
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for
23 May,
the following meeting is scheduled for
30 May.
</p>

<p>
Any regrets for the following meeting?
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[1/12]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-08: RD to clarify how namespace comparisons are performed.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-026-01: MK to write a summary paper that outlines the decisions we need to make on “value sequences”
<ul class="org-ul">
<li>This is related to PR #368: Issue 129 - Context item generalized to context value and
subsequent discussion.</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> QT4CG-029-01: RD+DN to draft spec prose for the “divide and conquer” approach outlined in issue #399</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-029-07: NW to open the next discussion of #397 with a demo from DN
See PR <a href="https://qt4cg.org/dashboard/#pr-449">#449</a></li>
<li class="off"><code>[&#xa0;]</code> QT4CG-034-01: CG to add exception for date-time types to <code>deep-equal</code></li>
<li class="off"><code>[&#xa0;]</code> QT4CG-034-02: NW to check ExprSingle on PR #447 before merging this PR.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-034-03: NW to check why the diff for PR #447 is off the wrong base</li>
</ul>
</div>
</div>

<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests</h3>
<div class="outline-text-3" id="text-open-pull-requests">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-454">#491</a>: Fix more examples in the FO 4.0 spec</li>
</ul>

<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-512">#512</a>: 256: Context for default function parameter expressions</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-470">#470</a>: 369 add fixed-prefixes attribute in XSLT</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-412">#412</a>: 409, QT4CG-027-01: xsl:next-match</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-396">#396</a>: 333: Deep-equal, no failure when comparing functions</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-368">#368</a>: 129: Context item generalized to context value</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>

<div id="outline-container-iss-504" class="outline-3">
<h3 id="iss-504"><span class="section-number-3">2.1.</span> Issue #504: Merge map:keys and map:keys-where</h3>
<div class="outline-text-3" id="text-iss-504">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/504">#504</a></li>
</ul>

<p>
Assuming we agree to merge them, then:
</p>
</div>

<div id="outline-container-pr-515" class="outline-4">
<h4 id="pr-515"><span class="section-number-4">2.1.1.</span> PR #515: 504: Merge map:keys and map:keys-where</h4>
<div class="outline-text-4" id="text-pr-515">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/dashboard/#pr-515">#515</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-pr-470" class="outline-3">
<h3 id="pr-470"><span class="section-number-3">2.2.</span> PR #470: 369 add fixed-prefixes attribute in XSLT</h3>
<div class="outline-text-3" id="text-pr-470">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/dashboard/#pr-470">#470</a></li>
</ul>
</div>
</div>

<div id="outline-container-pr-396" class="outline-3">
<h3 id="pr-396"><span class="section-number-3">2.3.</span> PR #396: 333: Deep-equal, no failure when comparing functions</h3>
<div class="outline-text-3" id="text-pr-396">
<ul class="org-ul">
<li>See PR <a href="https://qt4cg.org/dashboard/#pr-396">#396</a></li>
</ul>
</div>
</div>

<div id="outline-container-iss-480" class="outline-3">
<h3 id="iss-480"><span class="section-number-3">2.4.</span> Issue #480: Allow type promotion of xs:string to xs:anyURI</h3>
<div class="outline-text-3" id="text-iss-480">
<ul class="org-ul">
<li>See Issue <a href="https://github.com/qt4cg/qtspecs/issues/480">#480</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-iss-414" class="outline-3">
<h3 id="iss-414"><span class="section-number-3">2.5.</span> Issue #414: Lift character set restriction of xs:string</h3>
<div class="outline-text-3" id="text-iss-414">
<ul class="org-ul">
<li>See Issue <a href="https://github.com/qt4cg/qtspecs/issues/414">#414</a>.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>